In [57]:
import pandas as pd

In [58]:
df = pd.read_csv('https://raw.githubusercontent.com/YoungjinBD/data/main/exam/9_1_1.csv')
df.head()

   year  gender  지역코드    금액1    금액2
0  2018       0   143  70713  43210
1  2019       0   183  40306  39663
2  2017       0   129  26646  41631
3  2019       0   161  56843  12455
4  2019       0   174  26371   9014

In [69]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   year    100 non-null    int64
 1   gender  100 non-null    int64
 2   지역코드    100 non-null    int64
 3   금액1     100 non-null    int64
 4   금액2     100 non-null    int64
 5   총대출액    100 non-null    int64
dtypes: int64(6)
memory usage: 4.8 KB

In [59]:
# 총대출액 생성 
df['총대출액'] = df['금액1'] + df['금액2']
df.head()

   year  gender  지역코드    금액1    금액2    총대출액
0  2018       0   143  70713  43210  113923
1  2019       0   183  40306  39663   79969
2  2017       0   129  26646  41631   68277
3  2019       0   161  56843  12455   69298
4  2019       0   174  26371   9014   35385

In [66]:
df_pivot = df.pivot_table(
    index = ['year', '지역코드'], 
    columns = 'gender', 
    values = '총대출액', 
    aggfunc= 'sum', 
    fill_value= 0
)

In [67]:
df_pivot

gender         0       1
year 지역코드
2015 101       0   87088
     118       0  100609
     130       0   41599
     131   37881       0
     150       0   56775
...          ...     ...
2020 176   85767       0
     178   71066       0
     192       0  109436
     195       0   34792
     196   76900       0

[91 rows x 2 columns]

In [68]:
# 두 값의 차이의 절대값

df_pivot['abs_diff'] = abs(df_pivot[0] - df_pivot[1])
df_pivot

gender         0       1  abs_diff
year 지역코드
2015 101       0   87088     87088
     118       0  100609    100609
     130       0   41599     41599
     131   37881       0     37881
     150       0   56775     56775
...          ...     ...       ...
2020 176   85767       0     85767
     178   71066       0     71066
     192       0  109436    109436
     195       0   34792     34792
     196   76900       0     76900

[91 rows x 3 columns]

In [17]:
df_pivot.sort_values('abs_diff', ascending=False).index[0][1]

np.int64(143)

In [71]:
df.groupby(['year', '지역코드', 'gender'])['총대출액'].sum().unstack()

gender           0         1
year 지역코드
2015 101       NaN   87088.0
     118       NaN  100609.0
     130       NaN   41599.0
     131   37881.0       NaN
     150       NaN   56775.0
...            ...       ...
2020 176   85767.0       NaN
     178   71066.0       NaN
     192       NaN  109436.0
     195       NaN   34792.0
     196   76900.0       NaN

[91 rows x 2 columns]

# 2번

In [39]:
df = pd.read_csv('https://raw.githubusercontent.com/YoungjinBD/data/main/exam/9_1_2.csv')
df.head()

,연도,구분,범죄유형1,범죄유형2,범죄유형3,범죄유형4,범죄유형5,범죄유형6,범죄유형7,범죄유형8,범죄유형9,범죄유형10
0,2000,발생건수,302,635,470,306,271,900,220,814,321,666
1,2000,검거건수,302,430,470,187,271,199,220,230,321,408
2,2001,발생건수,969,543,691,613,585,391,476,360,659,513
3,2001,검거건수,121,352,691,613,574,158,476,360,575,513
4,2002,발생건수,982,389,886,762,766,443,704,330,684,846

In [40]:
df1 = df[df["구분"] == "검거건수"].set_index("연도").drop(columns="구분")
df2 = df[df["구분"] == "발생건수"].set_index("연도").drop(columns="구분")

In [51]:
df1.head()

      범죄유형1  범죄유형2  범죄유형3  범죄유형4  범죄유형5  범죄유형6  범죄유형7  범죄유형8  범죄유형9  범죄유형10
연도
2000    302    430    470    187    271    199    220    230    321     408
2001    121    352    691    613    574    158    476    360    575     513
2002    120    266    373    487    700    415    113    330    684     445
2003    180    539    291    101    489    627    205    871    234     405
2004    351    801    395    361    401    469    437    152    661     316

In [41]:
dfratio = df1 / df2

In [42]:
dfratio

,범죄유형1,범죄유형2,범죄유형3,범죄유형4,범죄유형5,범죄유형6,범죄유형7,범죄유형8,범죄유형9,범죄유형10
연도,,,,,,,,,,
2000,1.000000,0.677165,1.000000,0.611111,1.000000,0.221111,1.000000,0.282555,1.000000,0.612613
2001,0.124871,0.648250,1.000000,1.000000,0.981197,0.404092,1.000000,1.000000,0.872534,1.000000
2002,0.122200,0.683805,0.420993,0.639108,0.913838,0.936795,0.160511,1.000000,1.000000,0.526005
2003,0.235602,1.000000,1.000000,0.178445,0.747706,1.000000,0.289548,0.893333,1.000000,1.000000
2004,0.584027,0.862217,0.523179,1.000000,1.000000,1.000000,0.929787,0.232061,1.000000,0.341253
2005,0.236760,1.000000,0.986183,0.234104,0.991667,1.000000,1.000000,1.000000,1.000000,0.953959
2006,0.270492,0.254325,0.619342,0.734398,1.000000,1.000000,0.872247,1.000000,1.000000,0.659857
2007,0.953092,0.605911,0.462935,0.135392,0.674587,1.000000,1.000000,0.960114,0.871636,0.569514
2008,0.176933,1.000000,0.277599,1.000000,0.564356,0.430233,0.944093,0.792740,1.000000,0.886486
2009,0.782665,0.528994,0.574874,1.000000,0.352869,0.429139,0.897959,0.477432,0.720755,0.872467
2010,0.391778,0.352754,1.000000,1.000000,0.520352,1.000000,1.000000,0.673349,0.642166,0.902968
2011,1.000000,0.258621,1.000000,0.277851,0.216274,1.000000,0.545299,1.000000,1.000000,0.399015
2012,0.592466,0.893688,0.360812,0.860182,0.880952,0.566251,0.932185,0.451206,0.416942,1.000000
2013,1.000000,1.000000,0.798107,1.000000,0.621287,1.000000,1.000000,0.637306,0.470476,1.000000
2014,1.000000,0.431466,1.000000,0.452514,0.529762,0.739264,0.998512,0.288571,0.656352,0.710262
2015,0.591069,0.384969,0.648305,0.610028,1.000000,1.000000,1.000000,0.843823,1.000000,1.000000
2016,0.864686,1.000000,1.000000,0.836013,0.957687,0.739583,1.000000,1.000000,0.914339,0.258564
2017,1.000000,0.228333,0.392133,1.000000,0.746336,0.814871,1.000000,0.665505,0.570136,0.342466
2018,0.310924,0.612839,0.143564,0.561077,0.469118,0.394172,0.671329,0.202797,0.632708,1.000000
2019,1.000000,0.227754,1.000000,0.734864,0.474453,0.510057,0.842315,0.597368,0.145161,1.000000
2020,0.271949,0.769935,0.630689,1.000000,0.229379,0.496468,0.418182,0.564682,0.160093,0.687351
2021,0.993190,0.637787,0.677069,1.000000,0.787293,0.343262,0.812766,0.512443,1.000000,1.000000
2022,1.000000,0.915509,0.870680,1.000000,0.393316,1.000000,1.000000,0.707602,0.197659,1.000000
2023,0.897436,1.000000,1.000000,1.000000,0.776978,0.398907,1.000000,0.822222,0.335470,0.782074
2024,0.904255,0.289747,1.000000,0.219192,1.000000,1.000000,0.698810,1.000000,0.445378,0.404494

In [ ]:
max_data = []
for idx in dfratio.index:
    max_value = max(dfratio.loc[idx])
    for col, val in zip(dfratio.columns , dfratio.loc[idx]):
        # print(col)
        # print(val)
        if val == max_value:
            max_data.append( [idx, col] )
max_data

In [50]:
max_df = pd.DataFrame(max_data, columns = ['연도', '범죄유형'])
max_df

      연도   범죄유형
0   2000  범죄유형1
1   2000  범죄유형3
2   2000  범죄유형5
3   2000  범죄유형7
4   2000  범죄유형9
..   ...    ...
82  2023  범죄유형7
83  2024  범죄유형3
84  2024  범죄유형5
85  2024  범죄유형6
86  2024  범죄유형8

[87 rows x 2 columns]

In [53]:
final_data = []
for year, kind in max_df.values:
    # print(year)
    # print(kind)
    val = df1.loc[year, kind]
    final_data.append(
        [year, kind, val]
    )
final_df = pd.DataFrame(final_data, columns = ['연도', '범죄유형', '검거건수'])

In [54]:
final_df.head()

     연도   범죄유형  검거건수
0  2000  범죄유형1   302
1  2000  범죄유형3   470
2  2000  범죄유형5   271
3  2000  범죄유형7   220
4  2000  범죄유형9   321

In [56]:
final_df['검거건수'].sum()

np.int64(36977)

# 3번

In [18]:
df = pd.read_csv('https://raw.githubusercontent.com/YoungjinBD/data/main/exam/9_1_3.csv')
df.head()

          부서 등급     평균만족도  근속연수  교육참가횟수
0    Finance  C  4.023911  17.0     8.0
1  Marketing  A  3.756698  14.0    16.0
2         IT  B  2.628697  21.0    13.0
3  Marketing  A  3.196616   NaN    18.0
4  Marketing  C  4.770665  28.0    10.0

In [19]:
df.isna().sum()

부서         0
등급         0
평균만족도     10
근속연수      10
교육참가횟수     0
dtype: int64

In [20]:
df["평균만족도"] = df["평균만족도"].fillna(df["평균만족도"].mean())

In [21]:
df.isna().sum()

부서         0
등급         0
평균만족도      0
근속연수      10
교육참가횟수     0
dtype: int64

In [22]:
mean_tenure = (
  df.groupby(["부서", "등급"])["근속연수"]
  .mean()
  .astype(int)
  .reset_index()
  .rename(columns = {"근속연수": "평균근속연수"})
)

In [23]:
mean_tenure

           부서 등급  평균근속연수
0     Finance  A      10
1     Finance  B      18
2     Finance  C      11
3          HR  A      17
4          HR  B      11
5          HR  C      12
6          IT  A      16
7          IT  B      14
8          IT  C       8
9   Marketing  A      19
10  Marketing  B      15
11  Marketing  C      21
12      Sales  A      17
13      Sales  B      15
14      Sales  C      17

In [24]:
df = pd.merge(df, mean_tenure, on=['부서', "등급"], how='left')
df.head()

          부서 등급     평균만족도  근속연수  교육참가횟수  평균근속연수
0    Finance  C  4.023911  17.0     8.0      11
1  Marketing  A  3.756698  14.0    16.0      19
2         IT  B  2.628697  21.0    13.0      14
3  Marketing  A  3.196616   NaN    18.0      19
4  Marketing  C  4.770665  28.0    10.0      21

In [26]:
flag_null = df['근속연수'].isna()

In [28]:
df.loc[flag_null, '근속연수'] = df.loc[flag_null, '평균근속연수']

In [29]:
df.loc[flag_null]

           부서 등급     평균만족도  근속연수  교육참가횟수  평균근속연수
3   Marketing  A  3.196616  19.0    18.0      19
41         HR  A  3.888002  17.0     5.0      17
50    Finance  B  3.756996  18.0    16.0      18
51    Finance  B  4.742776  18.0    16.0      18
65    Finance  A  4.229738  10.0     1.0      10
75      Sales  B  3.920772  15.0    18.0      15
77    Finance  A  3.419290  10.0    17.0      10
81         HR  C  3.482744  12.0    19.0      12
91         HR  B  2.560790  11.0     5.0      11
99         HR  C  4.820796  12.0    17.0      12

In [30]:
df.isna().sum()

부서        0
등급        0
평균만족도     0
근속연수      0
교육참가횟수    0
평균근속연수    0
dtype: int64

In [32]:
A = df.loc[
    (df['부서'] == 'HR') & (df['등급'] == 'A'), 
    '근속연수'
].mean()

In [33]:
A

np.float64(17.625)

In [35]:
B = df.loc[
    (df['부서'] == 'Sales') & (df['등급'] == 'B'), 
    '교육참가횟수'
].mean()

In [37]:
B

np.float64(7.6)

In [38]:
A + B

np.float64(25.225)